//RUNCOB JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=144M,COND=(16,LT)
//STEP1    EXEC IGYWCL,SRC='PR040'
//COBOL.SYSIN  DD DISP=SHR,DSN=&SYSUID..COBOL(PR040)
//LKED.SYSLMOD DD DISP=SHR,DSN=&SYSUID..LOAD(PR040)
//STEP2 EXEC PGM=PR040
//* //TST     DD DSN=&SYSUID..DATA(TST),DISP=SHR
//* //CHNGE   DD DSN=&SYSUID..DATA(CHFILE),DISP=SHR
//* //MSFILE  DD DSN=&SYSUID..DATA(MSFILE),DISP=SHR
//OUTFILE DD DSN=&SYSUID..DATA.OUTFILE,
//           DISP=(NEW,CATLG,CATLG),
//           SPACE=(CYL,(10,5)),
//           DCB=(RECFM=FB,LRECL=80)
//RPT     DD DSN=&SYSUID..DATA.RPTFILE,
//           DISP=(NEW,CATLG,CATLG),
//           SPACE=(CYL,(10,5)),
//           DCB=(RECFM=FB,LRECL=80)
//ST      DD DSN=&SYSUID..TEST.STATE,DISP=SHR
//DLV     DD DSN=&SYSUID..TEST.DELIVERY,DISP=SHR
//COU     DD DSN=&SYSUID..TEST.COURIER,DISP=SHR
//BRN     DD DSN=&SYSUID..TEST.BRANCH,DISP=SHR
//STEPLIB DD DISP=SHR,DSN=&SYSUID..LOAD(PR040)
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
